In [1]:
import numpy as np
import pandas as pd

In [4]:
data=pd.read_csv("sample1.csv")

In [5]:
data

   AGE  SALARY
0   23   80000
1   21   62000
2   23   80000
3   23   62000
4   56   10000
5   15   14000
6   34  100000
7   21   34000
8   20   40000
9   56   10000

In [6]:
dup=data.duplicated()
dup

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [7]:
a=data['AGE'].unique()
a

array([23, 21, 56, 15, 34, 20], dtype=int64)

In [8]:
b=data['SALARY'].unique()
b

array([ 80000,  62000,  10000,  14000, 100000,  34000,  40000],
      dtype=int64)

In [9]:
print(dup.drop_duplicates())

0    False
2     True
dtype: bool

In [10]:
dc=data.drop_duplicates(['AGE'])
dc

   AGE  SALARY
0   23   80000
1   21   62000
4   56   10000
5   15   14000
6   34  100000
8   20   40000

In [11]:
adc=data.drop_duplicates(['SALARY'])
adc

   AGE  SALARY
0   23   80000
1   21   62000
4   56   10000
5   15   14000
6   34  100000
7   21   34000
8   20   40000

#### The duplicated() function returns a boolean Series object with the same length as the DataFrame. Each element in the Series indicates whether the corresponding row is a duplicate (True) or not (False).

#### drop_duplicated---It removes duplicates from the data